# BEGIN Private Brewfile
# YubiKey Manager
brew "ykman"

# GPG
brew "gnupg"
brew "pinentry-mac"

# Git
brew "git"
brew "git-lfs"
brew "gh"

brew "mas"

# Yubico Authenticator
mas "Yubico Authenticator", id: 1497506650
# END Private Brewfile

# Official Tap
brew "adns"
brew "agg"
brew "asciinema"
brew "bat"
brew "bazel"
brew "bootloadhid"
brew "clang-format"
brew "cmake"
brew "curl"
brew "doctl"
brew "dfu-programmer"
brew "dfu-util"
brew "ffmpeg"
brew "gifsicle"
brew "gist"
brew "go"
brew "gptfdisk"
brew "graphviz"
brew "imagemagick"
brew "kubernetes-cli"
brew "linkerd"
brew "lua"
brew "luarocks"
brew "make"
brew "mbedtls"
brew "mkcert"
brew "mockery"
brew "neofetch"
brew "node"
brew "openjdk@8"
brew "oq"
brew "p7zip"
brew "python@3.10"
brew "qt"
brew "qt@5"
brew "rclone"
brew "rtmpdump"
brew "s3cmd"
brew "swig"
brew "synergy"
brew "teensy_loader_cli"
brew "w3m"
brew "wget"
brew "xdotool"
brew "yarn"
brew "youtube-dl"

# Java
brew "openjdk@17"

# MongoDB Tap
tap "mongodb/brew"
brew "mongodb/brew/mongodb-community-shell"
brew "mongodb/brew/mongodb-database-tools"

# QMK Tap
tap "qmk/qmk"
brew "qmk/qmk/mdloader"
brew "qmk"

# TinyGo
tap "tinygo-org/tools"
tap "osx-cross/avr"
tap "osx-cross/arm"
tap "tasanakorn/homebrew-esp32"

brew "tinygo"
brew "osx-cross/avr/avr-gcc@8"
brew "osx-cross/arm/arm-gcc-bin@8"
brew "avrdude"
brew "xtensa-esp32-elf"

# Tools Tap
tap "ghifari160/tools"
brew "ghifari160/tools/migrate"

# Twitch
tap "twitchdev/twitch"
brew "twitch-cli"

# App Store apps
# Sign in through the App Store
mas "Final Cut Pro", id: 424389933
mas "RSS Bot", id: 605732865
mas "Keynote", id: 409183694
mas "Kindle", id: 405399194
mas "GarageBand", id: 682658836
mas "Motion", id: 434290957
mas "Numbers", id: 409203825
mas "Xcode", id: 497799835
mas "MainStage", id: 634159523
mas "Pages", id: 409201541
mas "iMovie", id: 408981434
mas "Logic Pro", id: 634148309
mas "Compressor", id: 424390742

# Cask Drivers Tap
tap "homebrew/cask-drivers"

# Casks
tap "homebrew/cask"
tap "homebrew/services"
cask "adobe-creative-cloud"
cask "autodesk-fusion360"
cask "backblaze" # /usr/local/Caskroom/backblaze/Backblaze Installer.app
cask "chatterino"
cask "cyberduck"
cask "db-browser-for-sqlite"
cask "discord"
cask "disk-inventory-x"
cask "docker"
cask "elgato-thunderbolt-dock"
cask "gitkraken"
cask "google-chrome"
cask "google-drive"
cask "handbrake"
cask "intellij-idea-ce"
cask "league-of-legends" # /usr/local/Caskroom/league-of-legends/Install League of Legends na.app
cask "loopback"
cask "mediainfo"
cask "minecraft"
cask "multimc"
cask "obs"
cask "obs-ndi"
cask "parsec"
cask "postman"
cask "prusaslicer"
cask "qlab"
cask "qmk-toolbox"
cask "raspberry-pi-imager"
cask "spotify"
cask "steam"
cask "syncthing"
cask "tg-pro"
cask "ultimaker-cura"
cask "via"
cask "visual-studio-code"
cask "vlc"
cask "vmware-fusion"
cask "xquartz"
