# BEGIN Private Brewfile
# YubiKey Manager
brew "ykman"

# GPG
brew "gnupg"
brew "pinentry-mac"

# Git
brew "git"
brew "git-lfs"

brew "mas"

# Yubico Authenticator
# mas "Yubico Authenticator", id: 1497506650
# END Private Brewfile

# Official Tap
brew "adns"
brew "asciinema"
brew "bat"
brew "cmake"
brew "doctl"
brew "ffmpeg"
brew "gh"
brew "gifsicle"
brew "gist"
brew "go"
brew "go@1.16"
brew "go@1.13"
brew "gptfdisk"
brew "imagemagick"
brew "kubernetes-cli"
brew "linkerd"
brew "lua"
brew "luarocks"
brew "mbedtls"
brew "mkcert"
brew "neofetch"
brew "node"
brew "openjdk@8"
brew "oq"
brew "p7zip"
brew "qt"
brew "qt@5"
brew "rclone"
brew "rtmpdump"
brew "swig"
brew "w3m"
brew "wget"
brew "xdotool"
brew "yarn"

# MongoDB Tap
tap "mongodb/brew"
brew "mongodb/brew/mongodb-community-shell"
brew "mongodb/brew/mongodb-database-tools"

# QMK Tap
tap "qmk/qmk"
brew "qmk"

# App Store apps
# Sign in through the App Store
# mas "Final Cut Pro", id: 424389933
# mas "RSS Bot", id: 605732865
# mas "Keynote", id: 409183694
# mas "Kindle", id: 405399194
# mas "GarageBand", id: 682658836
# mas "Motion", id: 434290957
# mas "Numbers", id: 409203825
# mas "Xcode", id: 497799835
# mas "MainStage", id: 634159523
# mas "Pages", id: 409201541
# mas "iMovie", id: 408981434
# mas "Logic Pro", id: 634148309
# mas "Compressor", id: 424390742

# Cask Drivers Tap
tap "homebrew/cask-drivers"

# Casks
cask "adobe-creative-cloud"
cask "autodesk-fusion360"
cask "backblaze" # Backblaze Installer.app
cask "chatterino"
cask "cyberduck"
cask "db-browser-for-sqlite"
cask "discord"
cask "disk-inventory-x"
cask "docker"
cask "elgato-thunderbolt-dock"
cask "gitkraken"
cask "google-chrome"
cask "google-drive"
cask "handbrake"
cask "intellij-idea-ce"
cask "league-of-legends" # Install League of Legends na.app
cask "loopback"
cask "mediainfo"
cask "minecraft"
cask "multimc"
cask "obs"
cask "obs-ndi"
cask "postman"
cask "qmk-toolbox"
cask "raspberry-pi-imager"
cask "spotify"
cask "steam"
cask "syncthing"
cask "synergy"
cask "tg-pro"
cask "ultimaker-cura"
cask "via"
cask "visual-studio-code"
cask "vlc"
